import csv
attr = \
{
    '0': '文件名',
    '1': '行数',
    '2': '最大行长',
    '3': '最大缩进数',
    '4': '关键字个数',
    '5': '标识符数量',
    '6': '最大标识符长度',
    '7': '数字数量',
    '8': '圆括号数量',
    '9': '界符数量',
    '10': '空行数量',
    '11': '注释行数',
    '12': '逗号数量',
    '13': '表达式数量',#??????????????
    '14': 'if分支数量',
    '15': 'while结构数量',
    '16': 'for结构数量',
    '17': '赋值操作数量',
    '18': '比较操作数量', #
    '19': '函数的数量',
    '20': '类长度（行数）',
    '21': '函数参数个数最大值',
    '22': '函数参数个数平均值',
    '23': '最大缩进数目',
    '24': '单行最大逻辑运算符个数',
    '25': '程序块中逻辑运算符个数', #
    '26': '变量名含有拼音的个数',
    '27': '函数的结构复杂度',
    '28': '标识符平均长度',
    '29': '算术运算符数量',
    '30': '函数参数长度最大值',
    '31': '参数长度和（有多个取最大）',
    '32': '数组最大深度'
}


def writeCSV(mainList = None):
    with open('.//result.csv', 'w', newline='') as csv_file:
        csv_writer = csv.writer(csv_file)
        csv_writer.writerow(attr.values())

        keys = list(mainList.keys())
        for i in keys:
            csv_writer.writerow(mainList[i])

        csv_file.close()

